<template>
    <dv-border-box-12>
        <dv-scroll-board class="pre-charts" :config="config"/>
    </dv-border-box-12>
</template>
<script>
export default {
    name:'regionNumList',
    data(){
        return{
            config:{
                header: ['品牌', '陈列容量', '上架数','上架品牌数','上架规格数', '上架厂商数', '品牌上架率率'], 
                data: [
                    ['南京', '1000', '800','800','1000', '800','80%'],
                    ['利群', '5800', '3900','5800','3000', '840','67%'],
                    ['双喜', '2000', '1000','1500', '1000','830','50%'],
                    ['芙蓉王', '1000','1000', '800','700', '830','80%'],
                    ['中南海', '10000', '689','340','1000', '800','68.9%'],
                    ['泰山', '1000', '1000','1050', '1000','760','100%'],
                    ['贵烟', '1000', '600','1000', '340','800','60%'],
                    ['中华', '1000', '700','1600', '340','340','70%']
                ],
                index: true,
                columnWidth: [50],
                align: ['center']
            }
        }
    }
}
</script>
<style scoped lang='less'>
    @import './common.less';
</style>
